In [35]:
#Import libraries

In [36]:
import pandas as pd
import numpy as np

In [37]:
#I look for the CSV of shark attacks
attacks = pd.read_csv('/Users/ezequielhoffmann/Desktop/Ironhack/PR02-project-pandas/attacks.csv', encoding='iso-8859-1')

In [38]:
#Display
attacks

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25718,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25719,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25720,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25721,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
attacks.shape

(25723, 24)

In [40]:
#Drop al columns that I do not need for my analisys.
attacks.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

# Dropping columns, NaNs and rows that I do not need for my analisys.

In [41]:
to_drop = ['Case Number.1', 'Case Number.2', 'Case Number', 'Unnamed: 22',
       'Unnamed: 23','pdf', 'href formula', 'href', 'original order', 'Age', 'Time', 'Investigator or Source', 'Time', 'Name']

In [42]:
attacks.drop(to_drop, inplace=True, axis=1)

In [43]:
attacks.dropna(subset = ["Country","Fatal (Y/N)","Activity","Area","Location","Type","Year","Injury"], inplace = True)

In [44]:
attacks

,Date,Year,Type,Country,Area,Location,Activity,Sex,Injury,Fatal (Y/N),Species
0,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,F,"No injury to occupant, outrigger canoe and pad...",N,White shark
1,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,F,Minor injury to left thigh,N,NaN
2,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,M,Injury to left lower leg from surfboard skeg,N,NaN
3,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,M,Minor injury to lower leg,N,2 m shark
4,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,M,Lacerations to leg & hand shark PROVOKED INCIDENT,N,"Tiger shark, 3m"
...,...,...,...,...,...,...,...,...,...,...,...
6290,Before 19-Jul-1913,0.0,Unprovoked,SOUTH AFRICA,KwaZulu-Natal,Durban,Wading,M,"FATAL, leg stripped of flesh",Y,NaN
6296,Before 1906,0.0,Unprovoked,AUSTRALIA,New South Wales,,Swimming,M,FATAL,Y,Said to involve a grey nurse shark that leapt ...
6297,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,M,FATAL,Y,NaN
6299,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,M,FATAL,Y,NaN
6301,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,M,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN

In [45]:
attacks.shape

(4743, 11)

In [46]:
#I drop all the row with all NaN. I found that from row 6302 until the last one are empty
drop_NaN = attacks.dropna(how='all', inplace = True)

In [47]:
drop_NaN

In [48]:
attacks

,Date,Year,Type,Country,Area,Location,Activity,Sex,Injury,Fatal (Y/N),Species
0,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,F,"No injury to occupant, outrigger canoe and pad...",N,White shark
1,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,F,Minor injury to left thigh,N,NaN
2,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,M,Injury to left lower leg from surfboard skeg,N,NaN
3,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,M,Minor injury to lower leg,N,2 m shark
4,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,M,Lacerations to leg & hand shark PROVOKED INCIDENT,N,"Tiger shark, 3m"
...,...,...,...,...,...,...,...,...,...,...,...
6290,Before 19-Jul-1913,0.0,Unprovoked,SOUTH AFRICA,KwaZulu-Natal,Durban,Wading,M,"FATAL, leg stripped of flesh",Y,NaN
6296,Before 1906,0.0,Unprovoked,AUSTRALIA,New South Wales,,Swimming,M,FATAL,Y,Said to involve a grey nurse shark that leapt ...
6297,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,M,FATAL,Y,NaN
6299,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,M,FATAL,Y,NaN
6301,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,M,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN

In [49]:
attacks.sort_values('Country', ascending=True, inplace=True)

In [50]:
attacks

,Date,Year,Type,Country,Area,Location,Activity,Sex,Injury,Fatal (Y/N),Species
1679,13-Apr-2004,2004.0,Invalid,TONGA,Nuku'alofa,30 nautical miles offshore,Five men on makeshift raft after their 10 m fi...,M,He was was bitten on the arm by small sharks &...,Y,Questionable Incident
2035,12-Jul-2000,2000.0,Unprovoked,TONGA,Minerva Reef,Treated at Nuku-alofa,Scuba diving,M,Left arm bitten,N,"Grey reef shark, 2 m [6.75']"
1678,13-Apr-2004,2004.0,Unprovoked,TONGA,Nuku'alofa,30 nautical miles offshore,Five men on makeshift raft after their 10 m fi...,M,"Bitten on feet, legs, back & abdomen but survi...",Y,small sharks
4316,29-Dec-1954,1954.0,Unprovoked,AMERICAN SAMOA,Tutuila Island,Near tuna cannery in Pago Pago Harbor,Dived overboard & was swimming near stern of t...,M,FATAL,Y,NaN
4286,08-Aug-1955,1955.0,Unprovoked,AMERICAN SAMOA,Tutuila Island,Pago Pago Bay,Swimming,M,"FATAL, abdomen bitten",Y,Blue shark
...,...,...,...,...,...,...,...,...,...,...,...
1394,22-Mar-2007,2007.0,Unprovoked,YEMEN,Muhafazat Hadramawt,Ras-Alkalb,Murder,NaN,"FATAL, beaten & thrown overboard by smugglers...",Y,NaN
5611,09-Jun-1897,1897.0,Sea Disaster,YEMEN,Socotra Islands,Socotra,Wreck of the steamship Sultan of Bombay,NaN,FATAL,Y,NaN
5603,Summer of 1898,1898.0,Unprovoked,YEMEN,Aden,Harbor,Diving for coins,M,FATAL,Y,NaN
5592,14-Jul-1898,1898.0,Unprovoked,YEMEN,Aden,Sapper Bay,Standing,M,FATAL,Y,NaN
5591,15-Jul-1898,1898.0,Unprovoked,YEMEN,Aden,Outer Harbor,Swimming at side of small boat,M,"FATAL, severe injuries to both arms & legs, 3 ...",Y,NaN

In [51]:
attacks1 = attacks[['Country','Date', 'Year', 'Area', 'Activity', 'Fatal (Y/N)']]

In [52]:
attacks1

,Country,Date,Year,Area,Activity,Fatal (Y/N)
1679,TONGA,13-Apr-2004,2004.0,Nuku'alofa,Five men on makeshift raft after their 10 m fi...,Y
2035,TONGA,12-Jul-2000,2000.0,Minerva Reef,Scuba diving,N
1678,TONGA,13-Apr-2004,2004.0,Nuku'alofa,Five men on makeshift raft after their 10 m fi...,Y
4316,AMERICAN SAMOA,29-Dec-1954,1954.0,Tutuila Island,Dived overboard & was swimming near stern of t...,Y
4286,AMERICAN SAMOA,08-Aug-1955,1955.0,Tutuila Island,Swimming,Y
...,...,...,...,...,...,...
1394,YEMEN,22-Mar-2007,2007.0,Muhafazat Hadramawt,Murder,Y
5611,YEMEN,09-Jun-1897,1897.0,Socotra Islands,Wreck of the steamship Sultan of Bombay,Y
5603,YEMEN,Summer of 1898,1898.0,Aden,Diving for coins,Y
5592,YEMEN,14-Jul-1898,1898.0,Aden,Standing,Y
5591,YEMEN,15-Jul-1898,1898.0,Aden,Swimming at side of small boat,Y

# Finding Fatal missing values

In [53]:
attacks1.groupby('Fatal (Y/N)').count()['Country']

Fatal (Y/N)
 N            5
2017          1
M             1
N          3695
UNKNOWN      23
Y          1018
Name: Country, dtype: int64

In [54]:
attacks1[attacks1['Fatal (Y/N)'] == ' N']

,Country,Date,Year,Area,Activity,Fatal (Y/N)
3944,AUSTRALIA,20-Dec-1960,1960.0,Queensland,"Fishing, when line became snagged on rock & he...",N
3946,AUSTRALIA,27-Nov-1960,1960.0,Queensland,Swimming,N
3948,AUSTRALIA,11-Nov-1960,1960.0,Queensland,Chasing shark out of bathing area while riding...,N
3949,AUSTRALIA,06-Nov-1960,1960.0,Western Australia,"Spearfishing, speared fish retreated to cave w...",N
3956,PAPUA NEW GUINEA,Oct-1960,1960.0,New Britain,Collecting shells,N

In [55]:
attacks1[attacks1['Fatal (Y/N)'] == 'UNKNOWN']

,Country,Date,Year,Area,Activity,Fatal (Y/N)
2661,AUSTRALIA,01-Oct-1989,1989.0,Victoria,Surfing,UNKNOWN
3552,AUSTRALIA,13-Sep-1966,1966.0,Western Australia,Spearfishing,UNKNOWN
5998,AUSTRALIA,06-Feb-1856,1856.0,Victoria,Swimming,UNKNOWN
4998,AUSTRALIA,11-Jan-1932,1932.0,Victoria,Fishing,UNKNOWN
5270,AUSTRALIA,16-Mar-1919,1919.0,New South Wales,Cutter capsized,UNKNOWN
4323,CROATIA,02-Oct-1954,1954.0,Zadar County,Boating,UNKNOWN
3411,CROATIA,1970,1970.0,Zadar County,Spearfishing,UNKNOWN
5709,INDIA,1890,1890.0,Tamil Nadu,Diving,UNKNOWN
5708,INDIA,1890,1890.0,Tamil Nadu,Diving,UNKNOWN
6169,INDIA,1595,1595.0,Kerala,Ship lay at anchor & man was working on its ru...,UNKNOWN
3794,ISRAEL,Reported 31-Aug-1962,1962.0,Sharon,Fishing,UNKNOWN
4256,ITALY,25-Mar-1956,1956.0,Ligurian Sea,Boating,UNKNOWN
2996,ITALY,1982,1982.0,Tyrrhenian Sea,Boat,UNKNOWN
5409,PHILIPPINES,1910,1910.0,Luzon Island,Swimming,UNKNOWN
5159,SOUTH AFRICA,1926,1926.0,Western Cape Province,Swimming to mail boat,UNKNOWN
2998,TUNISIA,1982,1982.0,Biserta,Spearfishing,UNKNOWN
5653,USA,21-Aug-1894,1894.0,New York,Swimming,UNKNOWN
5656,USA,29-Jun-1894,1894.0,Florida,Bathing,UNKNOWN
5555,USA,13-Sep-1900,1900.0,Rhode Island,Diving,UNKNOWN
2882,USA,19-Sep-1984,1984.0,Florida,Swimming,UNKNOWN
4269,USA,1956,1956.0,Virginia,Swimming,UNKNOWN
3006,USA,17-Oct-1981,1981.0,Florida,Surfing,UNKNOWN
3429,USA,27-Jun-1969,1969.0,Florida,Wading,UNKNOWN

In [56]:
attacks1[attacks1['Fatal (Y/N)'] == 'M']

              Country         Date    Year      Area      Activity Fatal (Y/N)
285  FRENCH POLYNESIA  18-Apr-2016  2016.0  Tuamotos  Spearfishing           M

In [57]:
attacks1[attacks1['Fatal (Y/N)'] == '2017']

,Country,Date,Year,Area,Activity,Fatal (Y/N)
786,ITALY,10-Jun-2012,2012.0,Sardinia,Attempting to rescue an injured & beached shark,2017

In [58]:
attacks_drop_rows = attacks1.drop([3944, 3946, 3948, 3949, 3956, 2661, 3552, 5998, 4998, 5270, 4323, 3411, 5709, 5708, 6169, 3794, 4256, 2996, 5409, 5159, 2998, 5653, 5656, 5555, 2882, 4269, 3006, 3429, 285, 786], axis=0)

In [59]:
attacks_drop_rows

,Country,Date,Year,Area,Activity,Fatal (Y/N)
1679,TONGA,13-Apr-2004,2004.0,Nuku'alofa,Five men on makeshift raft after their 10 m fi...,Y
2035,TONGA,12-Jul-2000,2000.0,Minerva Reef,Scuba diving,N
1678,TONGA,13-Apr-2004,2004.0,Nuku'alofa,Five men on makeshift raft after their 10 m fi...,Y
4316,AMERICAN SAMOA,29-Dec-1954,1954.0,Tutuila Island,Dived overboard & was swimming near stern of t...,Y
4286,AMERICAN SAMOA,08-Aug-1955,1955.0,Tutuila Island,Swimming,Y
...,...,...,...,...,...,...
1394,YEMEN,22-Mar-2007,2007.0,Muhafazat Hadramawt,Murder,Y
5611,YEMEN,09-Jun-1897,1897.0,Socotra Islands,Wreck of the steamship Sultan of Bombay,Y
5603,YEMEN,Summer of 1898,1898.0,Aden,Diving for coins,Y
5592,YEMEN,14-Jul-1898,1898.0,Aden,Standing,Y
5591,YEMEN,15-Jul-1898,1898.0,Aden,Swimming at side of small boat,Y

In [60]:
attacks_drop_rows.groupby('Fatal (Y/N)').count()['Country']

Fatal (Y/N)
N    3695
Y    1018
Name: Country, dtype: int64

In [61]:
attacks_drop_rows.pivot_table(index='Country', columns='Fatal (Y/N)', aggfunc='count')

               Activity          Area          Date          Year
Fatal (Y/N)           N      Y      N      Y      N      Y      N      Y
Country
 TONGA              1.0    2.0    1.0    2.0    1.0    2.0    1.0    2.0
AMERICAN SAMOA      NaN    3.0    NaN    3.0    NaN    3.0    NaN    3.0
ARGENTINA           1.0    NaN    1.0    NaN    1.0    NaN    1.0    NaN
ATLANTIC OCEAN      NaN    1.0    NaN    1.0    NaN    1.0    NaN    1.0
AUSTRALIA         817.0  260.0  817.0  260.0  817.0  260.0  817.0  260.0
...                 ...    ...    ...    ...    ...    ...    ...    ...
VENEZUELA           4.0    1.0    4.0    1.0    4.0    1.0    4.0    1.0
VIETNAM             8.0    NaN    8.0    NaN    8.0    NaN    8.0    NaN
WESTERN SAMOA       NaN    1.0    NaN    1.0    NaN    1.0    NaN    1.0
YEMEN               NaN    2.0    NaN    2.0    NaN    2.0    NaN    2.0
YEMEN               NaN    4.0    NaN    4.0    NaN    4.0    NaN    4.0

[134 rows x 8 columns]

In [62]:
attacks = pd.melt(attacks_drop_rows, id_vars =['Country'], value_vars =['Fatal (Y/N)'], 
              var_name ='Fatal')

In [63]:
attacks

             Country        Fatal value
0              TONGA  Fatal (Y/N)     Y
1              TONGA  Fatal (Y/N)     N
2              TONGA  Fatal (Y/N)     Y
3     AMERICAN SAMOA  Fatal (Y/N)     Y
4     AMERICAN SAMOA  Fatal (Y/N)     Y
...              ...          ...   ...
4708           YEMEN  Fatal (Y/N)     Y
4709          YEMEN   Fatal (Y/N)     Y
4710          YEMEN   Fatal (Y/N)     Y
4711          YEMEN   Fatal (Y/N)     Y
4712          YEMEN   Fatal (Y/N)     Y

[4713 rows x 3 columns]

In [64]:
attacks.sort_values(by=['Country'])

             Country        Fatal value
0              TONGA  Fatal (Y/N)     Y
1              TONGA  Fatal (Y/N)     N
2              TONGA  Fatal (Y/N)     Y
3     AMERICAN SAMOA  Fatal (Y/N)     Y
4     AMERICAN SAMOA  Fatal (Y/N)     Y
...              ...          ...   ...
4708           YEMEN  Fatal (Y/N)     Y
4711          YEMEN   Fatal (Y/N)     Y
4709          YEMEN   Fatal (Y/N)     Y
4710          YEMEN   Fatal (Y/N)     Y
4712          YEMEN   Fatal (Y/N)     Y

[4713 rows x 3 columns]

In [65]:
attacks.shape

(4713, 3)

In [66]:
attacks.tail(50)

            Country        Fatal value
4663            USA  Fatal (Y/N)     N
4664            USA  Fatal (Y/N)     N
4665            USA  Fatal (Y/N)     N
4666            USA  Fatal (Y/N)     N
4667            USA  Fatal (Y/N)     N
4668            USA  Fatal (Y/N)     N
4669            USA  Fatal (Y/N)     N
4670            USA  Fatal (Y/N)     N
4671            USA  Fatal (Y/N)     N
4672            USA  Fatal (Y/N)     N
4673            USA  Fatal (Y/N)     N
4674            USA  Fatal (Y/N)     N
4675            USA  Fatal (Y/N)     N
4676            USA  Fatal (Y/N)     N
4677            USA  Fatal (Y/N)     N
4678            USA  Fatal (Y/N)     N
4679            USA  Fatal (Y/N)     N
4680            USA  Fatal (Y/N)     N
4681            USA  Fatal (Y/N)     N
4682            USA  Fatal (Y/N)     N
4683        VANUATU  Fatal (Y/N)     N
4684        VANUATU  Fatal (Y/N)     Y
4685        VANUATU  Fatal (Y/N)     Y
4686        VANUATU  Fatal (Y/N)     N
4687        VANUATU  Fatal (Y/N)     Y
4688        VANUATU  Fatal (Y/N)     Y
4689        VANUATU  Fatal (Y/N)     N
4690        VANUATU  Fatal (Y/N)     Y
4691        VANUATU  Fatal (Y/N)     Y
4692        VANUATU  Fatal (Y/N)     N
4693      VENEZUELA  Fatal (Y/N)     N
4694      VENEZUELA  Fatal (Y/N)     N
4695      VENEZUELA  Fatal (Y/N)     Y
4696      VENEZUELA  Fatal (Y/N)     N
4697      VENEZUELA  Fatal (Y/N)     N
4698        VIETNAM  Fatal (Y/N)     N
4699        VIETNAM  Fatal (Y/N)     N
4700        VIETNAM  Fatal (Y/N)     N
4701        VIETNAM  Fatal (Y/N)     N
4702        VIETNAM  Fatal (Y/N)     N
4703        VIETNAM  Fatal (Y/N)     N
4704        VIETNAM  Fatal (Y/N)     N
4705        VIETNAM  Fatal (Y/N)     N
4706  WESTERN SAMOA  Fatal (Y/N)     Y
4707          YEMEN  Fatal (Y/N)     Y
4708          YEMEN  Fatal (Y/N)     Y
4709         YEMEN   Fatal (Y/N)     Y
4710         YEMEN   Fatal (Y/N)     Y
4711         YEMEN   Fatal (Y/N)     Y
4712         YEMEN   Fatal (Y/N)     Y

In [67]:
attacks

             Country        Fatal value
0              TONGA  Fatal (Y/N)     Y
1              TONGA  Fatal (Y/N)     N
2              TONGA  Fatal (Y/N)     Y
3     AMERICAN SAMOA  Fatal (Y/N)     Y
4     AMERICAN SAMOA  Fatal (Y/N)     Y
...              ...          ...   ...
4708           YEMEN  Fatal (Y/N)     Y
4709          YEMEN   Fatal (Y/N)     Y
4710          YEMEN   Fatal (Y/N)     Y
4711          YEMEN   Fatal (Y/N)     Y
4712          YEMEN   Fatal (Y/N)     Y

[4713 rows x 3 columns]

In [68]:
attacks.sort_values(['freq'], ascending=False, inplace = True)

KeyError: 'freq'

In [69]:
attacks

             Country        Fatal value
0              TONGA  Fatal (Y/N)     Y
1              TONGA  Fatal (Y/N)     N
2              TONGA  Fatal (Y/N)     Y
3     AMERICAN SAMOA  Fatal (Y/N)     Y
4     AMERICAN SAMOA  Fatal (Y/N)     Y
...              ...          ...   ...
4708           YEMEN  Fatal (Y/N)     Y
4709          YEMEN   Fatal (Y/N)     Y
4710          YEMEN   Fatal (Y/N)     Y
4711          YEMEN   Fatal (Y/N)     Y
4712          YEMEN   Fatal (Y/N)     Y

[4713 rows x 3 columns]

In [70]:
N_attacks = attacks.loc[attacks['value'] == 'N']
Y_attacks = attacks.loc[attacks['value'] == 'Y']

In [71]:
N_attacks

        Country        Fatal value
1         TONGA  Fatal (Y/N)     N
6     ARGENTINA  Fatal (Y/N)     N
8     AUSTRALIA  Fatal (Y/N)     N
9     AUSTRALIA  Fatal (Y/N)     N
10    AUSTRALIA  Fatal (Y/N)     N
...         ...          ...   ...
4701    VIETNAM  Fatal (Y/N)     N
4702    VIETNAM  Fatal (Y/N)     N
4703    VIETNAM  Fatal (Y/N)     N
4704    VIETNAM  Fatal (Y/N)     N
4705    VIETNAM  Fatal (Y/N)     N

[3695 rows x 3 columns]

In [72]:
Y_attacks

             Country        Fatal value
0              TONGA  Fatal (Y/N)     Y
2              TONGA  Fatal (Y/N)     Y
3     AMERICAN SAMOA  Fatal (Y/N)     Y
4     AMERICAN SAMOA  Fatal (Y/N)     Y
5     AMERICAN SAMOA  Fatal (Y/N)     Y
...              ...          ...   ...
4708           YEMEN  Fatal (Y/N)     Y
4709          YEMEN   Fatal (Y/N)     Y
4710          YEMEN   Fatal (Y/N)     Y
4711          YEMEN   Fatal (Y/N)     Y
4712          YEMEN   Fatal (Y/N)     Y

[1018 rows x 3 columns]

In [73]:
attacks = Y_attacks.set_index('Country')

In [77]:
attacks

                      Fatal value
Country
 TONGA          Fatal (Y/N)     Y
 TONGA          Fatal (Y/N)     Y
AMERICAN SAMOA  Fatal (Y/N)     Y
AMERICAN SAMOA  Fatal (Y/N)     Y
AMERICAN SAMOA  Fatal (Y/N)     Y
...                     ...   ...
YEMEN           Fatal (Y/N)     Y
YEMEN           Fatal (Y/N)     Y
YEMEN           Fatal (Y/N)     Y
YEMEN           Fatal (Y/N)     Y
YEMEN           Fatal (Y/N)     Y

[1018 rows x 2 columns]

In [81]:
attacks['freq'] = attacks.groupby('Country')['value'].transform('count')

In [82]:
attacks

                      Fatal value  freq
Country
 TONGA          Fatal (Y/N)     Y     2
 TONGA          Fatal (Y/N)     Y     2
AMERICAN SAMOA  Fatal (Y/N)     Y     3
AMERICAN SAMOA  Fatal (Y/N)     Y     3
AMERICAN SAMOA  Fatal (Y/N)     Y     3
...                     ...   ...   ...
YEMEN           Fatal (Y/N)     Y     2
YEMEN           Fatal (Y/N)     Y     4
YEMEN           Fatal (Y/N)     Y     4
YEMEN           Fatal (Y/N)     Y     4
YEMEN           Fatal (Y/N)     Y     4

[1018 rows x 3 columns]

In [83]:
attacks.sort_values(['freq'], ascending=False, inplace = True)

In [84]:
attacks

                    Fatal value  freq
Country
AUSTRALIA     Fatal (Y/N)     Y   260
AUSTRALIA     Fatal (Y/N)     Y   260
AUSTRALIA     Fatal (Y/N)     Y   260
AUSTRALIA     Fatal (Y/N)     Y   260
AUSTRALIA     Fatal (Y/N)     Y   260
...                   ...   ...   ...
PERSIAN GULF  Fatal (Y/N)     Y     1
SAN DOMINGO   Fatal (Y/N)     Y     1
CYPRUS        Fatal (Y/N)     Y     1
COLUMBIA      Fatal (Y/N)     Y     1
URUGUAY       Fatal (Y/N)     Y     1

[1018 rows x 3 columns]

In [92]:
Most_fatal = attacks.drop_duplicates()

In [94]:
Most_fatal.head(5)

                        Fatal value  freq
Country
AUSTRALIA         Fatal (Y/N)     Y   260
USA               Fatal (Y/N)     Y   168
SOUTH AFRICA      Fatal (Y/N)     Y   103
PAPUA NEW GUINEA  Fatal (Y/N)     Y    45
MEXICO            Fatal (Y/N)     Y    36

# Australia has the most FATAL victims since they started recolecting Data